<a href="https://colab.research.google.com/github/arshpreet10/Internity-Winter-Internship/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Panda

In [ ]:
import pandas as pd

**Creating Dataframe from a dictionary**

In [ ]:
dic= {'Day':[1,2,3,4,5,6],'Visitors':[43,53,34,45,64,34], 'Bounce_rate':[65, 72, 62, 64, 54, 66]}
df= pd.DataFrame(dic)
df.head()

   Day  Visitors  Bounce_rate
0    1        43           65
1    2        53           72
2    3        34           62
3    4        45           64
4    5        64           54

**Viewing the dataframe**



*   head() shows first 5 rows
*   tail() shows last 5 rows
*   head(2) shows first 2 rows

In [ ]:
print(df)

   Day  Visitors  Bounce_rate
0    1        43           65
1    2        53           72
2    3        34           62
3    4        45           64
4    5        64           54
5    6        34           66

**Setting a column as index column**

In [ ]:
print(df.set_index('Day'))
df.head()

     Visitors  Bounce_rate
Day
1          43           65
2          53           72
3          34           62
4          45           64
5          64           54
6          34           66

   Day  Visitors  Bounce_rate
0    1        43           65
1    2        53           72
2    3        34           62
3    4        45           64
4    5        64           54

In the above code, first line print does not make any changes in the original dataframe, and creates a new dataframe and prints it

In [ ]:
#df=df.set_index('Day')
df.set_index('Day', inplace=True)
df.head()

     Visitors  Bounce_rate
Day
1          43           65
2          53           72
3          34           62
4          45           64
5          64           54

**Refering Multiple Columns**

Using list of attributes, therefore double [[' ',' ']]

In [ ]:
df[['Visitors', 'Bounce_rate']]
#df.Visitors
#df.['Visitors']
#for single column

     Visitors  Bounce_rate
Day
1          43           65
2          53           72
3          34           62
4          45           64
5          64           54
6          34           66

**Converting to list**

In [ ]:
df.Visitors.tolist()

[43, 53, 34, 45, 64, 34]

**Reading CSV Files**

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data/Book1.csv')
df.head()

FileNotFoundError: ignored

Setting index to date and converting dataframe to CSV file

In [ ]:
df.set_index('Date', inplace=True)
df.to_csv('/content/drive/My Drive/Colab Notebooks/Data/newcsv1.csv')

index remains unchanged because csv files don't have index property

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data/newcsv1.csv')
df.head()

         Date  Values
0  30-09-2018     210
1  31-08-2018     205
2  31-07-2018     211
3  30-06-2018     211
4  31-05-2018     214

Specifiying the index column while reading

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data/newcsv1.csv', index_col=0)
df.head()

            Values
Date
30-09-2018     210
31-08-2018     205
31-07-2018     211
30-06-2018     211
31-05-2018     214

Changing coulmn name

In [ ]:
df.columns=['Austin_HPI']
df.head()

this will convert it into csv with changed column name

```
df.to_csv('newcsv2.csv')
```

Converting to csv without column titles and just data entries(no header)

In [ ]:
df.to_csv('/content/drive/My Drive/Colab Notebooks/Data/newcsv3.csv', header=False)

Reading from csv with no column titles

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data/newcsv3.csv', names=['Date','Austin_HPI'], index_col=0)
df.head()

            Austin_HPI
Date
30-09-2018         210
31-08-2018         205
31-07-2018         211
30-06-2018         211
31-05-2018         214

Renaming columns

In [ ]:
df.rename(columns={'Austin_HPI':'77006_HPI'}, inplace=True)
df.head()

            77006_HPI
Date
30-09-2018        210
31-08-2018        205
31-07-2018        211
30-06-2018        211
31-05-2018        214

Reading data from csv files with no columns titles

In [ ]:
df=pd.read_csv('/content/drive/My Drive/Colab Notebooks/Data/Book2.csv', names=['Date','Y','Z'], index_col=0)
df.head()

                Y      Z
Date
31-08-1982  76.90  75.50
31-07-1982  76.56  75.18
30-06-1982  76.12  75.07
31-05-1982  75.57  74.95
30-04-1982  74.95  74.70

**Fetching Data from Quandl package**

In [ ]:
! pip install Quandl

In [ ]:
import quandl
df= quandl.get("FMAC/HPI_AK")
df.head()

**Fetching Data from a website**

This will create a list of dataframes

In [ ]:
abbwebsite=pd.read_html('https://simple.wikipedia.org/wiki/U.S._postal_abbreviations')
print(abbwebsite)

[                                                    0               1
0   State Abbreviation State Name AK Alaska AL Ala...             NaN
1                                  State Abbreviation      State Name
2                                                  AK          Alaska
3                                                  AL         Alabama
4                                                  AR        Arkansas
5                                                  AZ         Arizona
6                                                  CA      California
7                                                  CO        Colorado
8                                                  CT     Connecticut
9                                                  DE        Delaware
10                                                 FL         Florida
11                                                 GA         Georgia
12                                                 HI          Hawaii
13                                                 IA            Iowa
14                                                 ID           Idaho
15                                                 IL        Illinois
16                                                 IN         Indiana
17                                                 KS          Kansas
18                                                 KY        Kentucky
19                                                 LA       Louisiana
20                                                 MA   Massachusetts
21                                                 MD        Maryland
22                                                 ME           Maine
23                                                 MI        Michigan
24                                                 MN       Minnesota
25                                                 MO        Missouri
26                                                 MS     Mississippi
27                                                 MT         Montana
28                                                 NC  North Carolina
29                                                 ND    North Dakota
30                                                 NE        Nebraska
31                                                 NH   New Hampshire
32                                                 NJ      New Jersey
33                                                 NM      New Mexico
34                                                 NV          Nevada
35                                                 NY        New York
36                                                 OH            Ohio
37                                                 OK        Oklahoma
38                                                 OR          Oregon
39                                                 PA    Pennsylvania
40                                                 RI    Rhode Island
41                                                 SC  South Carolina
42                                                 SD    South Dakota
43                                                 TN       Tennessee
44                                                 TX           Texas
45                                                 UT            Utah
46                                                 VA        Virginia
47                                                 VT         Vermont
48                                                 WA      Washington
49                                                 WI       Wisconsin
50                                                 WV   West Virginia
51                                                 WY         Wyoming,    State Abbreviation      State Name
0                  AK          Alaska
1                  AL         Alabama
2                  AR        Arkansas
3                  AZ         Arizona
4                  CA      California
5                  CO        Colorado
6                  CT     Connecticut
7                  DE        Delaware
8                  FL         Florida
9                  GA         Georgia
10                 HI          Hawaii
11                 IA            Iowa
12                 ID           Idaho
13                 IL        Illinois
14                 IN         Indiana
15                 KS          Kansas
16                 KY        Kentucky
17                 LA       Louisiana
18                 MA   Massachusetts
19                 MD        Maryland
20                 ME           Maine
21                 MI        Michigan
22                 MN       Minnesota
23                 MO        Missouri
24                 MS     Mississippi
25                 MT         Montana
26                 NC  North Carolina
27                 ND    North Dakota
28                 NE        Nebraska
29                 NH   New Hampshire
30                 NJ      New Jersey
31                 NM      New Mexico
32                 NV          Nevada
33                 NY        New York
34                 OH            Ohio
35                 OK        Oklahoma
36                 OR          Oregon
37                 PA    Pennsylvania
38                 RI    Rhode Island
39                 SC  South Carolina
40                 SD    South Dakota
41                 TN       Tennessee
42                 TX           Texas
43                 UT            Utah
44                 VA        Virginia
45                 VT         Vermont
46                 WA      Washington
47                 WI       Wisconsin
48                 WV   West Virginia
49                 WY         Wyoming,   Abbreviation              Location
0           DC  District of Columbia,   Abbreviation                  Location
0           AS            American Samoa
1           GU                      Guam
2           MP  Northern Mariana Islands
3           PR               Puerto Rico
4           VI       U.S. Virgin Islands,   Abbreviation                        Location
0           FM  Federated States of Micronesia
1           MH                Marshall Islands
2           PW                           Palau,   Abbreviation                                           Location
0           AA              Armed Forces Americas (except Canada)
1           AE  Armed Forces Europe (covers all USARAEUR)Armed...
2           AP                               Armed Forces Pacific,   Abbreviation                                Location
0           CZ                              Canal Zone
1           TT  Trust Territory of the Pacific Islands
2           PI                             Rizal state]

In [ ]:
abbwebsite[0].head()

                                                   0           1
0  State Abbreviation State Name AK Alaska AL Ala...         NaN
1                                 State Abbreviation  State Name
2                                                 AK      Alaska
3                                                 AL     Alabama
4                                                 AR    Arkansas

Creating required dataframe

In [ ]:
abb_df=abbwebsite[0][1:]
abb_df.head()

                    0           1
1  State Abbreviation  State Name
2                  AK      Alaska
3                  AL     Alabama
4                  AR    Arkansas
5                  AZ     Arizona

In [ ]:
abb_list=[]
for abb in abb_df[1:][0]:
  abb_list.append("FMAC/HPI_"+abb)
print (abb_list)

['FMAC/HPI_AK', 'FMAC/HPI_AL', 'FMAC/HPI_AR', 'FMAC/HPI_AZ', 'FMAC/HPI_CA', 'FMAC/HPI_CO', 'FMAC/HPI_CT', 'FMAC/HPI_DE', 'FMAC/HPI_FL', 'FMAC/HPI_GA', 'FMAC/HPI_HI', 'FMAC/HPI_IA', 'FMAC/HPI_ID', 'FMAC/HPI_IL', 'FMAC/HPI_IN', 'FMAC/HPI_KS', 'FMAC/HPI_KY', 'FMAC/HPI_LA', 'FMAC/HPI_MA', 'FMAC/HPI_MD', 'FMAC/HPI_ME', 'FMAC/HPI_MI', 'FMAC/HPI_MN', 'FMAC/HPI_MO', 'FMAC/HPI_MS', 'FMAC/HPI_MT', 'FMAC/HPI_NC', 'FMAC/HPI_ND', 'FMAC/HPI_NE', 'FMAC/HPI_NH', 'FMAC/HPI_NJ', 'FMAC/HPI_NM', 'FMAC/HPI_NV', 'FMAC/HPI_NY', 'FMAC/HPI_OH', 'FMAC/HPI_OK', 'FMAC/HPI_OR', 'FMAC/HPI_PA', 'FMAC/HPI_RI', 'FMAC/HPI_SC', 'FMAC/HPI_SD', 'FMAC/HPI_TN', 'FMAC/HPI_TX', 'FMAC/HPI_UT', 'FMAC/HPI_VA', 'FMAC/HPI_VT', 'FMAC/HPI_WA', 'FMAC/HPI_WI', 'FMAC/HPI_WV', 'FMAC/HPI_WY']

Concatenation and Appending

In [ ]:
df1 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2005, 2006, 2007, 2008])

df3 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'Low_tier_HPI':[50, 52, 50, 53]},
                   index = [2001, 2002, 2003, 2004])

In [ ]:
concat=pd.concat([df1,df2])
print(concat)

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

All columns are not same so give NaN value

In [ ]:
concat=pd.concat([df1,df2,df3])
concat

      HPI  Int_rate  US_GDP_Thousands  Low_tier_HPI
2001   80         2              50.0           NaN
2002   85         3              55.0           NaN
2003   88         2              65.0           NaN
2004   85         2              55.0           NaN
2005   80         2              50.0           NaN
2006   85         3              55.0           NaN
2007   88         2              65.0           NaN
2008   85         2              55.0           NaN
2001   80         2               NaN          50.0
2002   85         3               NaN          52.0
2003   88         2               NaN          50.0
2004   85         2               NaN          53.0

In [ ]:
df4=df1.append(df2)
df5=df1.append(df3)
df4
df5

      HPI  Int_rate  US_GDP_Thousands  Low_tier_HPI
2001   80         2              50.0           NaN
2002   85         3              55.0           NaN
2003   88         2              65.0           NaN
2004   85         2              55.0           NaN
2001   80         2               NaN          50.0
2002   85         3               NaN          52.0
2003   88         2               NaN          50.0
2004   85         2               NaN          53.0

Appending a series, (adding a row in the end)

In [ ]:
s = pd.Series([80,2,50], index=['HPI','Int_rate','US_GDP_Thousands'])
df4 = df1.append(s, ignore_index=True)
df4

   HPI  Int_rate  US_GDP_Thousands
0   80         2                50
1   85         3                55
2   88         2                65
3   85         2                55
4   80         2                50

**Joining and Merging**

In [ ]:
df1 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2005, 2006, 2007, 2008])

df3 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Unemployment':[7, 8, 9, 6],
                    'Low_tier_HPI':[50, 52, 50, 53]},
                   index = [2001, 2002, 2003, 2004])

In [ ]:
pd.merge(df1,df3, on='HPI')

   HPI  Int_rate  US_GDP_Thousands  Unemployment  Low_tier_HPI
0   80         2                50             7            50
1   85         3                55             8            52
2   85         3                55             6            53
3   85         2                55             8            52
4   85         2                55             6            53
5   88         2                65             9            50

In [ ]:
pd.merge(df1,df2,on=['HPI','Int_rate'])

   HPI  Int_rate  US_GDP_Thousands_x  US_GDP_Thousands_y
0   80         2                  50                  50
1   85         3                  55                  55
2   88         2                  65                  65
3   85         2                  55                  55

In [ ]:
df1.set_index('HPI', inplace=True)
df3.set_index('HPI', inplace=True)
joined=df1.join(df3)
joined

     Int_rate  US_GDP_Thousands  Unemployment  Low_tier_HPI
HPI
80          2                50             7            50
85          3                55             8            52
85          3                55             6            53
85          2                55             8            52
85          2                55             6            53
88          2                65             9            50

how()

1.   left df
2.   right df
3.   outer(union)
4.   inner(intersection)

In [ ]:
pd.merge(df1,df2, on='HPI', how='left')

   HPI  Int_rate_x  US_GDP_Thousands_x  Int_rate_y  US_GDP_Thousands_y
0   80           2                  50           2                  50
1   85           3                  55           3                  55
2   85           3                  55           2                  55
3   88           2                  65           2                  65
4   85           2                  55           3                  55
5   85           2                  55           2                  55